{
    "projects" : [
        {
            "image" : "images/projects/ootd.png",
            "title": "OOTD",
            "bodyText": "- Created a SwiftUI iOS app for users to get weather forecasts and outfits of the day based on outdoor temperature.\n -  Utilized Tomorrow.io Weather API integration to fetch location-based weather data with iOS native GPS feature.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/junseo-yang/ootd"
                }
            ],
            "tags" : [
                "SwiftUI",
                "iOS",
                "Weather API",
                "OOTD"
            ]
        },
        {
            "image" : "images/projects/fabulous-restaurant.png",
            "title": "Fabulous Restaurants",
            "bodyText": "- Developed an Angular web app for customers to write restaurant reviews with ratings and locations using WebSQL DB.\n - Leveraged Apache Cordova to transform the app to an Android mobile app providing cross-platform broader access.\n - Implemented reverse geocoding with HERE Maps API to store human-readable addresses instead of coordinates.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/junseo-yang/fabulous-restaurant"
                }
            ],
            "tags" : [
                "Angular",
                "jQuery",
                "Android",
                "Cordova"
            ]
        },
        {
            "image" : "images/projects/mask.png",
            "title": "Let's recycle masks during COVID-19",
            "bodyText": "- Led a team of 4, implementing a mask recycling solution to support business/individual eco-friendly decision-making.\n - Built a Ruby Jekyll web app to warn people about the danger of the surge of plastic waste and promote how to recycle masks properly in Bell Geekfest 2021 hackathon event organized by Bell Canada.\n - Dockerized the app to establish a consistent and seamless development environment between team members.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/junseo-yang/sanghwasuh.github.io"
                }
            ],
            "tags" : [
                "Ruby",
                "Jekyll",
                "Docker",
                "Hackathon",
                "Bell Geekfest"
            ]
        },
        {
            "image" : "images/projects/castle-defense.png",
            "title": "Castle defence",
            "bodyText": "- Engineered a 2.5D game using the MonoGame framework, employing an archer to defend a castle by defeating monsters and collecting scores, incorporating level systems, animations, and save/load functionality.\n - Crafted a game design document that illustrates features and class diagram information for maintenance.\n - Created a ClickOnce installer containing all necessary DLL files to deploy the .NET Windows Desktop application.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/junseo-yang/castle-defense"
                }
            ],
            "tags" : [
                "C#",
                ".NET",
                "MonoGame",
                "Windows"
            ]
        }
    ]
}